# Цикл
# Ввести с клавиатуры строку.
# Вывести эту же строку вертикально: по одному символу на строку консоли.
str = input('')
for s in str:
    print(s)
