# Цикл
# Создать список из десяти целых чисел.
# Вывести на экран каждое число, увеличенное на 1.

import random
for score in range(10):
    score += 1
    print(score)

